Repository: wp-plugins/modal-portfolio
Catalog: lang/modal-portfolio-*.po
Languages: fr_fr

source: Readme
fr_fr: Documentation

source: <strong>Modal portfolio</strong> is an image gallery plugin constituting a portfolio with filters and style effects.<br/>The extension uses a system shortcode <strong>[modal-portfolio]</strong> with options (described below).
fr_fr: <strong>Modal portfolio</strong> est un plugin de galeries d'images constituant un portfolio avec filtres et effets de style.<br/>L'extension utilise un système de shortcode <strong>[modal-portfolio]</strong> avec options (décrites ci-dessous).

source: The following documentation describes the installation and overall operation of the plugin.
fr_fr: La documentation ci-dessous explique l'installation et le fonctionnement global du plugin.

source: <em>N.B.: contact <a href="http://blog.internet-formation.fr/" target="_blank">Mathieu Chartier</a>, the creator of the plugin, for more information.</em>
fr_fr: <em>N.B. : n'hésitez pas à contacter <a href="http://blog.internet-formation.fr" target="_blank">Mathieu Chartier</a>, le créateur du plugin, pour de plus amples informations.</em>

source: Plugin customization
fr_fr: Personnalisation du plugin

source: 1. Set the general options
fr_fr: 1. Régler les options générales

source: Show blocks and manage desired effects
fr_fr: Afficher les blocs et gérer les effets désirés

source: Choose preferential blocks to display
fr_fr: Choisissez les blocs préférentiels à afficher

source: Optimize block display with customizable jQuery effects
fr_fr: Optimisez l'affichage des blocs avec des effets jQuery personnalisables

source: Screenshots
fr_fr: Captures d'écran

source: 2. Create portfolio categories
fr_fr: 2. Créer les catégories du portfolio

source: Fast and simple installation !
fr_fr: Installation simple et rapide !

source: Create parent and child categories (if desired).
fr_fr: Créez des catégories parentes et enfants (si désirées).

source: Be careful not to do too many offspring (categories and subcategories, no more ...).
fr_fr: Veillez à ne pas faire trop de descendances (catégories et sous-catégories, pas plus...).

source: Note: the plugin works well on both levels but may have some problems when there are several levels of subcategories if you do not check parent categories ...
fr_fr: N.B. : le plugin fonctionne bien sur deux niveaux mais peut avoir quelques soucis quand il y a plusieurs niveaux de sous-catégories si vous ne cochez pas les catégories parentes...

source: 3. Add the adapted shortcode [modal-portfolio]
fr_fr: 3. Ajouter le shortcode [modal-portfolio] adapté

source: Several options
fr_fr: Plusieurs options possibles

source: Use the shortcode [modal-portfolio] to display all.
fr_fr: Utilisez le shortcode [modal-portfolio] pour tout afficher.

source: Use the shortcode [modal-portfolio categorie_parente="category_name"] or [modal-portfolio parent_cat="category_name"] to display only the references of the selected category.
fr_fr: Utilisez le shortcode [modal-portfolio categorie_parente="nom_categorie"] ou [modal-portfolio parent_cat="nom_categorie"] pour n'afficher que les références de la catégorie choisie.

source: Use the shortcode [modal-portfolio parents=1] to display the items of parent categories and the corresponding filters (hidden by default).
fr_fr: Utilisez le shortcode [modal-portfolio parents=1] pour afficher les items des catégories parentes et les filtres correspondants (masquées par défaut).

source: Pair the two options if necessary as in the attached capture.
fr_fr: Couplez les deux options si nécessaire comme dans la capture ci-jointe.

source: 4. Add the items
fr_fr: 4. Ajouter les références

source: Fast and simple installation :
fr_fr: Installation simple et rapide :

source: Add a title to your portfolio item.
fr_fr: Ajouter un titre à votre item de portfolio.

source: Complete the description if you use the feature.
fr_fr: Remplissez la description si vous utilisez la fonctionnalité.

source: Add a title for the thumbnail overview (optional).
fr_fr: Ajouter un titre pour le survol des vignettes (optionnel).

source: Choose the post_thumbnail for the portfolio.
fr_fr: Choisissez l'image à la Une comme image de portfolio ou de galerie.

source: Add a video to display in the modal window (optional).
fr_fr: Ajouter une vidéo à afficher dans la fenêtre modale (optionnel).

source: Note: the video replaces the post thumbnail in the modal window.
fr_fr: N.B. : la vidéo remplace l'image à la Une dans la fenêtre modale.

source: 5. Adapt the CSS
fr_fr: 5. Adapter le CSS

source: Method 1:
fr_fr: Méthode 1 :

source: Display the path to your own CSS in options.
fr_fr: Affichez le chemin de votre propre CSS dans les options.

source: Create the corresponding stylesheet in your theme.
fr_fr: Créez la feuille de style correspondante dans votre thème.

source: NB: leave blank if you do not want to use a particular style sheet ...
fr_fr: N.B. : laissez vide si vous ne voulez pas utiliser une feuille de style particulière...

source: Method 2:
fr_fr: Méthode 2 :

source: Personalize the plugin stylesheet in the style options.
fr_fr: Personnalisez la feuille de style du plugin dans les options de style.

source: List of the CSS classes and IDs
fr_fr: Liste des classes et ID :

source: Complete block for a reference
fr_fr: bloc complet d'une référence

source: block information of a thumbnail
fr_fr: bloc d'informations d'une vignette

source: thumbnail background (jQuery effect)
fr_fr: fond d'écran d'une vignette (effet jQuery)

source: thumbnail title
fr_fr: titre d'une vignette

source: thumbnail category
fr_fr: catégorie de la vignette

source: block containing filters
fr_fr: bloc contenant les filtres

source: filter bouton
fr_fr: bouton d'un filtre

source: current filter button
fr_fr: bouton courant d'un filtre

source: block containing all references and modal
fr_fr: bloc contenant toutes les références et les modales

source: thumbnail block (with title and category)
fr_fr: bloc d'une vignette (avec titre et catégorie)

source: class of default hidden modal
fr_fr: classe de la modale cachée par défaut

source: complete block of the modal (with closing cross, etc.)
fr_fr: bloc complet de la modale (avec croix de fermeture, etc.)

source: background class (overlay)
fr_fr: couleur du fond (overlay)

source: modal block (content)
fr_fr: bloc de la modale (contenu)

source: block in .simple-modal-wrap
fr_fr: bloc contenu dans .simple-modal-wrap

source: block containing the video
fr_fr: bloc contenant la vidéo

source: CSS class of the modal closing cross
fr_fr: classe de la croix de fermeture de la modale

source: block that contains the information from the modal window
fr_fr: bloc qui contient les informations de la fenêtre modale

source: class of the image displayed in the modal window
fr_fr: classe de l'image affichée dans la fenêtre modale

source: class of content displayed in the modal
fr_fr: classe des contenus affichés dans la modale

source: class of the block containing the "Close" button
fr_fr: classe du bloc contenant le bouton "Fermer"

source: All items
fr_fr: Toutes les références

source: View item
fr_fr: Voir la référence

source: Add an item
fr_fr: Ajouter une référence

source: Add
fr_fr: Ajouter

source: Edit an item
fr_fr: Editer une référence

source: Update
fr_fr: Mettre à jour

source: Search for an item
fr_fr: Rechercher une référence

source: No result
fr_fr: Aucun résultat

source: No result in the trash
fr_fr: Aucun résultat dans la corbeille

source: Categories
fr_fr: Catégories

source: Settings
fr_fr: Options

source: CSS Styles
fr_fr: Styles CSS

source: View all categories
fr_fr: Voir toutes les références

source: The thumbnail title
fr_fr: Titre de la vignette

source: Add a video (overwrites the post thumbnail)
fr_fr: Ajout d'une vidéo (remplace l'image à la Une)

source: Title displayed when hovering the thumbnail in the references page (Porfolio)
fr_fr: Titre affiché lors du survol des vignettes dans la page des références (Porfolio)

source: Add a video using the media gallery or external URL:
fr_fr: Ajoutez une vidéo en utilisant la galerie des médias ou une URL externe :

source: - HTML 5 video formats supported (webm, mp4 and ogg).
fr_fr: - Formats de vidéo HTML 5 supportés (webm, mp4 et ogg).

source: - Videos from YouTube, Dailymotion and Vimeo (copy the video link in the field in this case).
fr_fr: - Vidéos YouTube, Dailymotion ou Vimeo (copier le lien de la vidéo dans le champ dans ce cas).

source: Note: if this field is filled, it takes the place of the post thumbnail (used by default).
fr_fr: N.B. : si ce champ est rempli, il prend la place de l'image à la Une (prise en compte par défaut).

source: Add a video
fr_fr: Ajouter une vidéo

source: Video URL
fr_fr: URL de la vidéo

source: Select or add a video
fr_fr: Sélectionnez ou ajoutez une vidéo

source: Use this video
fr_fr: Utilisez cette vidéo

source: Save
fr_fr: Enregistrer

source: Modal Portfolio Settings
fr_fr: Réglages de Modal Portfolio

source: <strong>Modal portfolio</strong> is an extension to display a photo gallery (portfolio) with modal (pop- in) possibly containing a customizable description.
fr_fr: <strong>Modal portfolio</strong> est une extension destinée à afficher une galerie photo (portfolio) avec des modales (pop-in) contenant éventuellement une description personnalisable.

source: Just use the shortcode <strong>[modal-portfolio]</strong> with or without options to display the references (<em>see documentation (readme section) for additional options</em>).
fr_fr: Il suffit d'utiliser le shortcode <strong>[modal-portfolio]</strong> avec ou sans options pour afficher les références (<em>voir la documentation pour les options complémentaires</em>).

source: Multiple options are permitted to customize to best display in the modal:
fr_fr: Plusieurs options sont permises afin de personnaliser au mieux l'affichage :

source: [modal-portfolio] to display all.
fr_fr: [modal-portfolio] pour tout afficher.

source: [modal-portfolio parents=1] to display the items of parent categories and the corresponding filters.
fr_fr: [modal-portfolio parents=1] pour afficher les items des catégories parentes et les filtres correspondants.

source: [modal-portfolio parent_cat="category_name"] or [modal-portfolio categorie_parente="category_name"] to show the child categories of items "category_name".
fr_fr: [modal-portfolio parent_cat="nom_categorie"] ou [modal-portfolio categorie_parente="nom_categorie"] pour afficher les items des catégories filles de "nom_categorie".

source: <em>N.B.: contact <a href="http://blog.internet-formation.fr/" target="_blank">Mathieu Chartier</a>, the creator of the plugin (French), for more information.</em>
fr_fr: <em>N.B. : cette extension n'est pas parfaite, n'hésitez pas à contacter <a href="http://blog.internet-formation.fr" target="_blank">Mathieu Chartier</a>, le créateur du plugin, pour de plus amples informations.</em>

source: General Settings
fr_fr: Paramétrage général

source: Yes
fr_fr: Oui

source: No
fr_fr: Non

source: Display filters?
fr_fr: Afficher les filtres ?

source: The option to hide the category filters portfolios.
fr_fr: L'option permet de masquer les filtres de catégories des portfolios.

source: Show the "All" filter?
fr_fr: Afficher le filtre "Tout" ?

source: This option allows to hide the filter that displays all references.
fr_fr: L'option permet de masquer le filtre qui affiche toutes les références.

source: Show description in modal window?
fr_fr: Afficher la description dans la fenêtre modale ?

source: The option allows you to change the modal window to display the image with or without description.
fr_fr: L'option permet de modifier la fenêtre modale pour afficher l'image avec ou sans description.

source: Show title in the modal window?
fr_fr: Afficher le titre dans la fenêtre modale ?

source: The option allows you to change the modal window to display the image with or without title.
fr_fr: L'option permet de modifier la fenêtre modale pour afficher l'image avec ou sans titre.

source: Show title and category when hovering thumbnail?
fr_fr: Afficher le titre et la catégorie au survol des vignettes ?

source: The option to hide text effects when hovering the thumbnail.
fr_fr: L'option permet de masquer les effets de texte au survol des vignettes.

source: View the "Close" button in the modal window?
fr_fr: Afficher le bouton "Fermer" dans la fenêtre modale ?

source: The option to hide the close button.
fr_fr: L'option permet de masquer le bouton de fermeture.

source: Customizing jQuery effects
fr_fr: Personnalisation des effets jQuery

source: Background opacity (overlay)
fr_fr: Niveau d'opacité du fond (overlay)

source: Ability to hide the background by setting the value to 0.
fr_fr: Possibilité de masquer le fond en mettant la valeur à 0.

source: Close modal clicking on the overlay?
fr_fr: Fermer la modale en cliquant sur le fond (overlay) ?

source: The option closes the modal window without pressing the "Close" button.
fr_fr: L'option permet de fermer la fenêtre modale sans appuyer sur le bouton "Fermer".

source: Background color (overlay)
fr_fr: Couleur du fond (overlay)

source: You can hide the overlay emptying the field.
fr_fr: Il est possible de masquer l'overlay en vidant le champ.

source: Display duration of the overlay (in ms)
fr_fr: Durée d'affichage du fond (en ms)

source: Select the number of milliseconds helpful to show the overlay.
fr_fr: Sélectionnez le nombre de millisecondes utiles pour afficher le fond.

source: Duration of effect to display the modal window and the contents (in ms)
fr_fr: Durée d'affichage de la modale et des contenus (en ms)

source: Select the number of milliseconds to display the modal window and the content
fr_fr: Sélectionnez le nombre de millisecondes utiles pour afficher la modale et les contenus

source: None
fr_fr: Aucun

source: Effect of style applied to the opening of the modal window
fr_fr: Effet de style appliqué à l'ouverture de la fenêtre modale

source: Only the opening jQuery effect considers this option!
fr_fr: Seul l'effet jQuery d'ouverture prend en compte cette option !

source: Apply effect to the title thumbnail?
fr_fr: Appliquer un effet pour le titre des vignettes ?

source: Blocks jQuery effects on thumbnail title
fr_fr: Bloque les effets jQuery sur les titres de vignettes

source: First effect applied to the text of the thumbnail
fr_fr: Premier effet appliqué au texte de la vignette

source: Effect applied when hovering the thumbnail !
fr_fr: Effet appliqué au survol de la vignette !

source: Duration of the first effect (in ms)
fr_fr: Durée du premier effet (en ms)

source: Select the number of milliseconds for the first useful effect.
fr_fr: Sélectionnez le nombre de millisecondes utiles pour le premier effet.

source: Second effect applied to the thumbnail text
fr_fr: Second effet appliqué au texte de la vignette

source: Effect applied after hovering the thumbnail
fr_fr: Effet appliqué lorsque l'on quitte le survol de la vignette !

source: Duration of the second effect (in ms)
fr_fr: Durée du second effet (en ms)

source: Select the number of milliseconds for the second useful effect.
fr_fr: Sélectionnez le nombre de millisecondes utiles pour le second effet.

source: All
fr_fr: Tous

source: Video format not supported by your browser, you can
fr_fr: Format vidéo non supporté par votre navigateur, vous pouvez

source: download the video
fr_fr: télécharger la vidéo

source: Close
fr_fr: Fermer

source: Modal Portfolio Styles
fr_fr: Styles CSS

source: CSS Settings
fr_fr: Options générales des CSS

source: URL of the CSS file of the theme
fr_fr: URL du fichier CSS du thème

source: The option allows to choose another if desired style sheet (leave empty to not use CSS)
fr_fr: L'option permet de choisir une autre feuille de style si désirée (laisser vide pour ne pas utiliser de CSS)

source: by default.
fr_fr: par défaut.

source: Use dynamic CSS?
fr_fr: Utiliser des CSS dynamiques ?

source: If "yes" is selected, the plugin uses a file style.php instead of style.css (and makes the right options used).
fr_fr: Si "oui" est sélectionné, le plugin utilise un fichier style.php plutôt que style.css (et rend les options de droite utilisables).

source: Style of the effects
fr_fr: Style des effets

source: Color of the rollover effect
fr_fr: Couleur des textes dans l'effet de survol

source: Background-color of the rollover effect
fr_fr: Couleur de fond dans l'effet de survol

source: top
fr_fr: Haut

source: bottom
fr_fr: Bas

source: Positioning the rollover effect over thumbnails
fr_fr: Positionnement de l'effet de survol au-dessus des vignettes

source: Height of the effect (in px)
fr_fr: Hauteur du bloc de l'effet de survol (en px)

source: Global padding of the effect (in px)
fr_fr: Padding général de l'effet de survol (en px)

source: left
fr_fr: gauche

source: center
fr_fr: centré

source: right
fr_fr: droite

source: justify
fr_fr: justifié

source: Text alignment in the rollover effect
fr_fr: Alignement du texte dans l'effet de survol

source: Style of the thumbnails and of the modal window
fr_fr: Style des vignettes et de la fenêtre modale

source: Rounded corners
fr_fr: Coins arrondis

source: Square corners
fr_fr: Coins carrés

source: Type of corners for the modal window
fr_fr: Type de coins utilisés pour la fenêtre modale

source: Border radius (if "rounded corners")
fr_fr: Rayon des coins arrondis (si l'option est sélectionnée)

source: Width of the thumbnails
fr_fr: Largeur des vignettes

source: Margin of the thumbnails
fr_fr: Marges appliquées aux vignettes

source: Style of the filters
fr_fr: Style des filtres

source: Link button background-color
fr_fr: Couleur du fond du bouton

source: Hover button background-color
fr_fr: Couleur de fond du bouton (au survol)

source: Link button color
fr_fr: Couleur du texte du bouton

source: Hover button color
fr_fr: Couleur du texte du bouton (au survol)

source: none
fr_fr: aucun

source: Borders style
fr_fr: Style des bordures

source: Type of corners
fr_fr: Type de coins

source: Margin of the filters
fr_fr: Marges appliquées aux filtres
